Repository: VBog/Bg-Orthodox-Calendar
Catalog: languages/*_ortcal-*.po
Languages: sr_rs

source: Январь
sr_rs: Јануар

source: Февраль
sr_rs: Фебруар

source: Апрель
sr_rs: Април

source: Май
sr_rs: Мај

source: Июнь
sr_rs: Јун

source: Июль
sr_rs: Јул

source: Сентябрь
sr_rs: Септембар

source: Октябрь
sr_rs: Октобар

source: Ноябрь
sr_rs: Новембар

source: Декабрь
sr_rs: Децембар

source: января
sr_rs: јануара

source: февраля
sr_rs: фебруара

source: апреля
sr_rs: априла

source: мая
sr_rs: маја

source: июня
sr_rs: јуна

source: июля
sr_rs: јула

source: сентября
sr_rs: септембра

source: октября
sr_rs: октобра

source: ноября
sr_rs: новембра

source: декабря
sr_rs: децембра

source: Воскресение
sr_rs: Недеља

source: Понедельник
sr_rs: Понедељак

source: Вторник
sr_rs: Уторак

source: Четверг
sr_rs: Четвртак

source: Пятница
sr_rs: Петак

source: Суббота
sr_rs: Субота

source: Вт
sr_rs: Ут

source: Сб
sr_rs: Су

source: Вс
sr_rs: Не

source: Светлое Христово Воскресение
sr_rs: Светло Васкрсење Христово

source: Двунадесятый праздник
sr_rs: Један од 12 великих празника

source: Великий праздник
sr_rs: Велики празник

source: Средний бденный праздник
sr_rs: Средњи празник са бденијем

source: Средний полиелейный праздник
sr_rs: Средњи полијелејни празник

source: Малый славословный праздник
sr_rs: Мали празник са славословљем

source: Малый шестиричный праздник
sr_rs: Мали шестерични празник

source: Вседневный праздник
sr_rs: Свакодневни празник

source: Памятная дата
sr_rs: Датум успомене

source: День особого поминовения усопших
sr_rs: Посебан дан за помињање уснулих

source: Постный день
sr_rs: Посни дан

source: Браковенчание не совершается
sr_rs: Не обавља се венчање

source: Показать дни браковенчаний
sr_rs: Показати дане када је дозвољено венчање

source: Если навести мышку на какую-нибудь дату высвечиваются: дата по старому стилю, праздники по типикону (от двунадесятых до вседневных), памятные даты, дни поминовения усопших, посты и сплошные седмицы. Если нажать на кнопку мыши на одном из дней текущего года, открывается дополнительное меню.
sr_rs: Ако пређете мишем преко било код приказаног датума: датуми по старом календару, празници по типику (от 12 великих до обичних), дани помена, дани помињања уснулих, поста и сплошные седмице. Ако притиснете тастер миша да један од дана у години, отвара се додатни мени.

source: Выберите дату
sr_rs: Изаберите датум

source: Закрыть
sr_rs: Затворите

source: предыдущий год
sr_rs: претходна година

source: следующий год
sr_rs: идућа година

source: вчера
sr_rs: јуче

source: сегодня
sr_rs: данас

source: завтра
sr_rs: сутра

source: ст.ст.
sr_rs: по старом календару

source: Наречение имени по месяцеслову
sr_rs: Давање имена по месецослову

source: Православный календарь
sr_rs: Православни календар

source: День рождения
sr_rs: Pођендан

source: Наречение имени на 8-й день от рождения
sr_rs: Давање имена у 8-и дан по рођењу

source: Таинство крещения на
sr_rs: Тајна крштења на

source: -й день от рождения
sr_rs: -и дан по рођењу

source: Предыдущий день
sr_rs: Претходни дан

source: Следующий день
sr_rs: Следећи дан

source: Неделя
sr_rs: Недеља

source: -я по Пятидесятнице
sr_rs: -а по Педесетници

source: -я Великого поста
sr_rs: -а Великог поста

source: -я по Пасхе
sr_rs: -а по Пасхи

source: Неделя о мытаре и фарисее
sr_rs: Недеља митара и фарисеја

source: Седмица о мытаре и фарисее
sr_rs: Седмица митара и фарисеја

source: Неделя о блудном сыне
sr_rs: Недеља блудног сина

source: Седмица о блудном сыне
sr_rs: Седмица блудног сина

source: Неделя мясопустная, о Страшнем суде
sr_rs: Недеља месопусна, о Страшном суду

source: Сырная седмица (масленица)
sr_rs: Сирна седмица

source: Неделя сыропустная. Воспоминание Адамова изгнания. Прощеное воскресенье
sr_rs: Недеља сиропусна. Спомен на Адамово изгнање из раја. Недеља праштања

source: Седмица 6-я Великого поста (седмица ваий)
sr_rs: Седмица 6-а Великог поста (цветна)

source: Неделя 6-я Великого поста ваий (цветоносная, Вербное воскресенье)
sr_rs: Недеља 6-а Великог поста - Цветна

source: Страстная седмица
sr_rs: Страстна седмица

source: Пасхальная (Светлая) седмица
sr_rs: Пасхална (Светла) седмица

source: Седмица 1-я по Пятидесятнице (Троицкая)
sr_rs: Седмица 1-а по Педесетници

source: в Год Рождества Христова
sr_rs: у години од Рођења Христовог

source: г. от РХ
sr_rs: г. од РХ

source: Праздники:
sr_rs: Празници:

source: Соборы святых:
sr_rs: Сабори светих:

source: День памяти святых:
sr_rs: Дан спомена светих:

source: День памяти исповедников и новомучеников Церкви Русской:
sr_rs: Дан успомене исповедника и новомученика Цркве Руске:

source: День почитания икон Божией Матери:
sr_rs: Дан поштовања иконе Мајке Божије:

source: Календарь на год
sr_rs: Календар за годину

source: Загрузка календаря
sr_rs: Учитавање календара

source: (j F ст.ст.)
sr_rs: (j F по старом календару)

source: Предыдущий месяц
sr_rs: Претходни месец

source: Календарь на
sr_rs: Календар за

source: Следующий месяц
sr_rs: Следећи месец

source: l, j F Y г. ст.ст.
sr_rs: l, j F Y г. по старом календару

source: Официальный календарь РПЦ
sr_rs: Официјелни календар РПЦ

source: Календарь на Православие.Ru
sr_rs: Календар са Православие.Ru

source: Богослужебные указания
sr_rs: Богослужбена указања

source: Календарь на Азбука веры
sr_rs: Календар са сајта Азбука веры

source: Этот день в календаре (страница)
sr_rs: Овај дан у календару (страница)

source: Этот день в календаре (окно)
sr_rs: Овај дан у календару (прозор)

source: Выбор имени по Месяцеслову
sr_rs: Избор имена по Месецослову

source: Воскресенье
sr_rs: Недеља

source: янв
sr_rs: јан

source: фев
sr_rs: феб

source: июн
sr_rs: јун

source: июл
sr_rs: јул

source: сен
sr_rs: сеп

source: ноя
sr_rs: нов

source: дек
sr_rs: дец

source: На утр.:
sr_rs: На јутр:

source: Ев.:
sr_rs: Јев.:

source: На 1-м часе:
sr_rs: На 1-ом часу:

source: На 3-м часе:
sr_rs: На 3-ем часу:

source: На 6-м часе:
sr_rs: На 6-ом часу:

source: На 9-м часе:
sr_rs: На 9-ом часу:

source: Евангелие и Апостол:
sr_rs: Јеванђеље и Апостол:

source: Псалтирь:
sr_rs: Псалтир:

source: Праздник:
sr_rs: Празник:

source: Светлое Христово Воскресение. Пасха
sr_rs: Светло Васкрсење Христово. Пасха

source: Вседневный праздник. Cовершается служба, не отмеченная в Типиконе никаким знаком
sr_rs: Обичан праздник. Врши се служба, не обележена у Типику никаквим знаком

source: Параметры сохранены.
sr_rs: Параметри сачувани

source: Внутренний кеш плагина сброшен. Удалено
sr_rs: Унутрашњи кеш додатка ресетован. Избрисано

source: опций.
sr_rs: опције.

source: Параметры плагина "Православный календарь"
sr_rs: Параметри додатка "Православный календарь"

source: Версия
sr_rs: Верзија

source: Цвета формы календаря
sr_rs: Боја форме календара

source: Основной цвет текста:
sr_rs: Основна боја текста:

source: Основной цвет фона:
sr_rs: Основа боја позадине:

source: Цвет заголовков:
sr_rs: Боја заглавља:

source: (стрелки перехода на другой год, названия месяцев)
sr_rs: (стрелице преласка на другу годину, назива месеци)

source: Дополнительный цвет текста:
sr_rs: Додатна боја текста:

source: (заголовок, подвал, дни недели)
sr_rs: (заглавље, подвал, дани недеље)

source: Дополнительный цвет фона:
sr_rs: Додатна боја позадине:

source: Цвет текста выбранного дня:
sr_rs: Боја текста изабраног дана:

source: (день, на который указывает курсор)
sr_rs: (дан, на који показује курсор)

source: Цвет фона выбранного дня:
sr_rs: Поја позадине изабраног дана:

source: Цвет текста сегодня:
sr_rs: Боја текста данас:

source: Цвет фона сегодня:
sr_rs: Боја позадине данас:

source: Цвет рамки дней браковенчаний:
sr_rs: Боја рама дана за венчања:

source: Z-index всплывающего окна календаря:
sr_rs: Z-index искачућег прозора календара:

source: Элементы всплывающего меню календаря
sr_rs: Елементи падајућег менија календара

source: Ссылка на сайт официального календаря РПЦ
sr_rs: Линк ка сајту официјелног календара РПЦ

source: Ссылка на сайт календаря на Православие.Ru
sr_rs: Линк ка сајту Православие.Ru

source: Ссылка на сайт богослужебных указаний
sr_rs: Линк ка сајту за богослужбена указања

source: Ссылка на сайт календаря Азбука веры
sr_rs: Линк ка сајту календара Азбука вере

source: Этот день в календаре (страница сайта)
sr_rs: Овај дан у календару (страница сајта)

source: Этот день в календаре (всплывающее окно)
sr_rs: Овај дан у календару (искачићи прозор)

source: Выбор имени по Месяцеслову (всплывающее окно)
sr_rs: Избор имена по Месецослову (искачући прозор)

source: Функция при двойном щелчке по дате
sr_rs: Функција при дуплом клику на датум

source: Прочие параметры ...
sr_rs: Остали параметри ...

source: Постоянная ссылка на страницу с календарем
sr_rs: Стални линк на страницу са календаром

source: Пользовательский XML-файл данных
sr_rs: Прилагођени XML-фајл са подацима

source: Только пользовательский XML-файл
sr_rs: Само прилагођени XML-фајл

source: Изображение кнопки ссылки
sr_rs: Слика тастера за линк

source: (Если изображение не задано (указан просто текст), то отображается указанный здесь текст в виде текстовой ссылки.<br> Если ничего не указано (пустая строка), то отображается название события как простая текстовая ссылка.)
sr_rs: (Ако слика није задана (подешен је само текст), приказује се изабрани овде текст у виду текстуалног линка.<br> Ако ништа није постављено (празан стринг), приказује се назив догађаја као обичан текстуални линк.)

source: Часовой пояс
sr_rs: Временска зона

source: (для определения даты на сервере)
sr_rs: (за одређивање датума на серверу)

source: Местное время на сервере:
sr_rs: Месно време на серверу

source: Метод чтения файлов
sr_rs: Метод читања фајлова

source: Внимание:
sr_rs: Опрез:

source: Некоторые методы могут быть недоступны на Вашем сервере.)
sr_rs: Неке методе могу бити недоступне на Вашем серверу.)

source: Сохранить настройки
sr_rs: Сачувати подешавања

source: Новый плагин
sr_rs: Нови додатак

source: копирует богослужебные указания с сайта Patriarchia.ru и вставляет их на страницу вашего сайта.
sr_rs: копира богослужбена указања са сајта Patriarchia.ru и поставља их на страницу вашег сајта.

source: Спасибо, что используете Православный календарь!
sr_rs: Хвала, што користите Православни календар!

source: Мне нравится этот плагин. Как я могу Вас отблагодарить?
sr_rs: Допада ми се овај додатак. Како могу да се захвалим?

source: Есть несколько путей сделать это:
sr_rs: Постоји неколико начина да то урадите:

source: Распространить информацию или написать заметку в свой блог о плагине.
sr_rs: Раширите информацију или напишите поруку на свом блогу о додатку.

source: Bg Orthodox Calendar - отличный плагин для православных сайтов на WordPress
sr_rs: Bg Orthodox Calendar - одличан додатак за православне сајтове на WordPress-у

source: Поддержка
sr_rs: Подршка

source: См. <a href="http://wordpress.org/support/plugin/bg-orthodox-calendar" target="_blank">форум поддержки</a> или мой <a href="http://bogaiskov.ru/plagin-orthodox-calendar/" target="_blank">персональный сайт</a> для справки.
sr_rs: См. <a href="http://wordpress.org/support/plugin/bg-orthodox-calendar" target="_blank">Форум подршке</a> или мой <a href="http://bogaiskov.ru/plagin-orthodox-calendar/" target="_blank">лични сајт</a> за информације.

source: Храни вас Господи!
sr_rs: Нека Вас Господ чува!
